AM-prepareSoapMultiplyrequest.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<AssignMessage continueOnError="false" enabled="true" name="AM-prepareSoapMultiplyrequest">
    <DisplayName>AM-prepareSoapMultiplyrequest</DisplayName>
    <Properties/>
    <Set>
        <Headers>
            <Header name="Content-Type">application/soap+xml;charset=UTF-8;action="http://tempuri.org/Multiply"</Header>
        </Headers>
        <QueryParams/>
        <FormParams/>
        <!-- <Verb>GET</Verb> -->
        <Path/>
        <Payload>
            <soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:tns="http://tempuri.org/">
                <soap12:Header/>
                <soap12:Body>
                    <tns:Multiply xmlns="http://tempuri.org/">
                        <tns:intA>{num1}</tns:intA>
                        <tns:intB>{num2}</tns:intB>
                    </tns:Multiply>
                </soap12:Body>
            </soap12:Envelope>
        </Payload>
    </Set>
    <AssignVariable>
        <Name>name</Name>
        <Value/>
        <Ref/>
    </AssignVariable>
    <IgnoreUnresolvedVariables>true</IgnoreUnresolvedVariables>
    <AssignTo createNew="false" transport="http" type="request"/>
</AssignMessage>